app/controllers/admin/articles_controller.rb

SELECT `news`.* FROM `news`  ORDER BY id desc
---
	def index
		@news = News.order('id desc')

INSERT INTO `news` (`title`, `summary`, `content`, `created_at`, `updated_at`) VALUES ('ferrgerg', 'ergergergerg', 'ergergergergerger', '2015-10-01 07:43:08', '2015-10-01 07:43:08')
---
	def create
	    @new = News.new(new_params)

		if @new.save

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
---
	def edit
		@new = News.find(params[:id])

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1
UPDATE `news` SET `image` = 'vanguard_bg.jpg', `updated_at` = '2015-11-15 14:36:29' WHERE `news`.`id` = 1
---
	def update
		@new = News.find(params[:id])

	    if @new.update_attributes(new_params)

DELETE FROM `news` WHERE `news`.`id` = 1
---
	def destroy
		News.destroy(params[:id])