app/controllers/admin/roulette_controller.rb

  	def index
		@roulettes = Roulette.order('id desc')
---
SELECT `roulettes`.* FROM `roulettes`  ORDER BY id desc

	def create
	    @roulette = Roulette.new(roulette_params)

		if @roulette.save
---
INSERT INTO `roulettes` (`team`, `strat`, `created_at`, `updated_at`) VALUES ('T', 'test', '2015-11-14 17:06:04', '2015-11-14 17:06:04')

	def edit
		@roulette = Roulette.find(params[:id])
---
SELECT  `roulettes`.* FROM `roulettes` WHERE `roulettes`.`id` = 1 LIMIT 1

	def update
		@roulette = Roulette.find(params[:id])

	    if @roulette.update_attributes(roulette_params)
---
SELECT  `roulettes`.* FROM `roulettes` WHERE `roulettes`.`id` = 2 LIMIT 1
UPDATE `roulettes` SET `team` = 'CT', `updated_at` = '2015-11-15 00:12:29' WHERE `roulettes`.`id` = 2

	def destroy
		Roulette.destroy(params[:id])
---
DELETE FROM `roulettes` WHERE `roulettes`.`id` = 2