app/controllers/admin/team_members_controller.rb

SELECT `team_members`.* FROM `team_members`  ORDER BY id desc
---
	def index
		@members = TeamMember.order('id desc')

INSERT INTO `team_members` (`name`, `id_steam`, `created_at`, `updated_at`) VALUES ('gaviil', 'fefzfzef', '2015-10-04 17:14:34', '2015-10-04 17:14:34')
---
	def create
	    @member = TeamMember.new(member_params)

		if @member.save

SELECT  `team_members`.* FROM `team_members` WHERE `team_members`.`id` = 3 LIMIT 1
---
	def edit
		@member = TeamMember.find(params[:id])

SELECT  `team_members`.* FROM `team_members` WHERE `team_members`.`id` = 1 LIMIT 1
UPDATE `team_members` SET `id_steam` = 'fefzfzefdd', `updated_at` = '2015-10-07 12:50:30' WHERE `team_members`.`id` = 1
---
	def update
		@member = TeamMember.find(params[:id])

	    if @member.update_attributes(member_params)

DELETE FROM `team_members` WHERE `team_members`.`id` = 2
---
	def destroy
		TeamMember.destroy(params[:id])