app/controllers/admin/users_controller.rb

    def index
		@users = User.order('id desc')
---
SELECT `users`.* FROM `users`  ORDER BY id desc

	def edit
		@user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1