app/controllers/articles_controller.rb

	def index
    	@news = News.order('id desc')
---
SELECT `news`.* FROM `news`  ORDER BY id desc

    def show
    	@new = News.find(params[:id])
---
SELECT  `news`.* FROM `news` WHERE `news`.`id` = 1 LIMIT 1