app/controllers/team_controller.rb

    def show
    	@member = TeamMember.find(params[:id])
---
SELECT  `team_members`.* FROM `team_members` WHERE `team_members`.`id` = 1 LIMIT 1